ardaunal4/STM32F334xxDrivers/stm32f334xx_drivers/drivers/Src/stm32f334xx_usart_driver.c
/*
 * stm32f334xx_usart_driver.c
 *
 *  Created on: May 2, 2024
 *      Author: ardau
 */

#include "stm32f334xx_usart_driver.h"

/*
 * Peripheral Clock Setup
*/
/*****************************************************************
 * @fn          - USART_PeriClockControl
 *
 * @brief       - This function enables or disables peripheral
 *                clock for the given USART port
 *
 * @param[in]   - Base address of the USART peripheral
 * @param[in]   - Macros: Enable or Disable
 *
 * @return      - None
 *
 * @Note        - None
 *
 *****************************************************************/
void USART_PeriClockControl(USART_RegDef_t *pUSARTx, uint8_t EnorDi)
{
     if (EnorDi == ENABLE)
    {
        if (pUSARTx == USART1)
        {
            USART1_PCLK_EN();
        }else if (pUSARTx == USART2)
        {
            USART2_PCLK_EN();
        }else if (pUSARTx == USART3)
        {
            USART3_PCLK_EN();
        }
    }else
    {
        if (pUSARTx == USART1)
        {
            USART1_PCLK_DI();
        }else if (pUSARTx == USART2)
        {
            USART2_PCLK_DI();
        }else if (pUSARTx == USART3)
        {
            USART3_PCLK_DI();
        }
    }
}

/*****************************************************************
 * @fn          - USART_PeripheralControl
 *
 * @brief       - This function initialize USART peripheral clock
 *
 * @param[in]   - Pointer to USART Handle structure
 * @param[in]   - Enable or Disable
 *
 * @return      - None
 *
 * @Note        - None
 *
 *****************************************************************/
void USART_PeripheralControl(USART_RegDef_t *pUSARTx, uint8_t EnOrDi)
{
    if (EnOrDi == ENABLE)
    {
        pUSARTx->USART_CR1 |= ( 1 << USART_CR1_UE );
    }else
    {
        pUSARTx->USART_CR1 &= ~( 1 << USART_CR1_UE );
    }  
}

/*
 * Init and De-init
*/
/*****************************************************************
 * @fn          - USART_Init
 *
 * @brief       - This function initialize USART peripherals
 *
 * @param[in]   - Pointer to USART Handle structure
 *
 * @return      - None
 *
 * @Note        - None
 *
 *****************************************************************/
void USART_Init(USART_Handle_t *pUSARTHandle)
{
    //Temporary variable
	uint32_t tempreg = 0;

    USART_PeriClockControl(USART1, ENABLE);

    /******************************** Configuration of CR1******************************************/

	// Enable USART Tx and Rx engines according to the USART_Mode configuration item
	if (pUSARTHandle->USART_Config.USART_Mode == USART_MODE_ONLY_RX)
	{
		tempreg |= (1 << USART_CR1_RE);

	}else if (pUSARTHandle->USART_Config.USART_Mode == USART_MODE_ONLY_TX)
	{
		tempreg |= ( 1 << USART_CR1_TE );

	}else if (pUSARTHandle->USART_Config.USART_Mode == USART_MODE_TXRX)
	{
		tempreg |= ( ( 1 << USART_CR1_TE) | ( 1 << USART_CR1_RE) );
	}

    // Configuration of the Word length configuration item 
    if (pUSARTHandle->USART_Config.USART_WordLength == USART_WORDLEN_7BITS)
    {
        tempreg &= ~(1 << USART_CR1_M0);
        tempreg |= 1 << USART_CR1_M1;
    }else
    {
        tempreg &= ~(1 << USART_CR1_M1);
        tempreg |= pUSARTHandle->USART_Config.USART_WordLength << USART_CR1_M0;
    }
    
    // Configuration of parity control bit fields
	if ( pUSARTHandle->USART_Config.USART_ParityControl == USART_PARITY_EN_EVEN)
	{ 
        tempreg |= 1 << USART_CR1_PCE;
		tempreg &= ~( 1 << USART_CR1_PS);

	}else if (pUSARTHandle->USART_Config.USART_ParityControl == USART_PARITY_EN_ODD )
	{
		tempreg |= 1 << USART_CR1_PCE;
		tempreg |= 1 << USART_CR1_PS;
	}

   // Program the CR1 register 
	pUSARTHandle->pUSARTx->USART_CR1 = tempreg;

    /******************************** Configuration of CR2******************************************/

	tempreg=0;
	tempreg |= pUSARTHandle->USART_Config.USART_NoOfStopBits << USART_CR2_STOP; 
	pUSARTHandle->pUSARTx->USART_CR2 = tempreg;

    /******************************** Configuration of CR3******************************************/

	tempreg=0;
	
	// Configuration of USART hardware flow control 
	if ( pUSARTHandle->USART_Config.USART_HWFlowControl == USART_HW_FLOW_CTRL_CTS)
	{
		tempreg |= ( 1 << USART_CR3_CTSE);
	}else if (pUSARTHandle->USART_Config.USART_HWFlowControl == USART_HW_FLOW_CTRL_RTS)
	{
		tempreg |= ( 1 << USART_CR3_RTSE);

	}else if (pUSARTHandle->USART_Config.USART_HWFlowControl == USART_HW_FLOW_CTRL_CTS_RTS)
	{
		tempreg |= ( ( 1 << USART_CR3_RTSE) | ( 1 << USART_CR3_CTSE) );
	}

	pUSARTHandle->pUSARTx->USART_CR3 = tempreg;

/******************************** Configuration of BRR(Baudrate register)******************************************/

	// configure the baud rate
	USART_SetBaudRate(pUSARTHandle->pUSARTx, pUSARTHandle->USART_Config.USART_BAUD);
}

/*****************************************************************
 * @fn          - USART_DeInit
 *
 * @brief       - This function de-initialize USART peripherals
 *
 * @param[in]   - Base address of the USART peripheral
 *
 * @return      - None
 *
 * @Note        - None
 *
 *****************************************************************/
void USART_DeInit(USART_RegDef_t *pUSARTx)
{

}

/*****************************************************************
 * @fn          - USART_GetFlagStatus
 *
 * @brief       - This function returns status of USART flags
 *
 * @param[in]   - Base address of the USART peripheral
 * @param[in]   - Flag name
 *
 * @return      - Content of the input data
 *
 * @Note        - This is blocking call
 *
 *****************************************************************/
uint8_t USART_GetFlagStatus(USART_RegDef_t *pUSARTx, uint32_t FlagName)
{
    if (pUSARTx->USART_ISR & FlagName)
    {
        return FLAG_SET;
    }
    
    return FLAG_RESET;
}

/*********************************************************************
 * @fn      		  - USART_ClearFlag
 *
 * @brief             -
 *
 * @param[in]         -
 * @param[in]         -
 * @param[in]         -
 *
 * @return            -
 *
 * @Note              - Applicable to only USART_CTS_FLAG , USART_LBD_FLAG
 * USART_BUSY_FLAG, USART_TC_FLAG flags
 *
 */
void USART_ClearFlag(USART_RegDef_t *pUSARTx, uint16_t StatusFlagName)
{
    pUSARTx->USART_ISR &= ~( StatusFlagName);
}

