ardaunal4/STM32F334xxDrivers/stm32f334xx_drivers/drivers/Src/stm32f334xx_usart_driver.c
/*
 * IRQ and ISR
*/
/*****************************************************************
 * @fn          - SPI_IRQInterruptConfig
 *
 * @brief       - This function configures interrupt
 *
 * @param[in]   - IRQ Interrupt number
 * @param[in]   - Macro: Enable/Disable
 *
 * @return      - None
 *
 * @Note        - None
 *
 *****************************************************************/
void USART_IRQInterruptConfig(uint8_t IRQNumber, uint8_t EnorDi)
{
    if (EnorDi == ENABLE)
    {
        if (IRQNumber <= 31)
        {
            // Program ISER0 register
            *NVIC_ISER0 |= ( 1 << IRQNumber );
        } else if (IRQNumber > 31  && IRQNumber < 64)
        {
            // Program ISER1 register
            *NVIC_ISER1 |= ( 1 << (IRQNumber % 32) );
        }else if (IRQNumber >= 64  && IRQNumber < 96)
        {
            // Program ISER2 register
            *NVIC_ISER2 |= ( 1 << (IRQNumber % 64) );
        }
    }else
    {
        if (IRQNumber <= 31)
        {
            // Program ICER0 register
            *NVIC_ICER0 |= ( 1 << IRQNumber );
        } else if (IRQNumber > 31  && IRQNumber < 64)
        {
            // Program ICER1 register
            *NVIC_ICER1 |= ( 1 << (IRQNumber % 32) );
        }else if (IRQNumber >= 64  && IRQNumber < 96)
        {
            // Program ICER2 register
            *NVIC_ICER2 |= ( 1 << (IRQNumber % 64) );
        }
    } 
}

/*****************************************************************
 * @fn          - SPI_IRQPriorityConfig
 *
 * @brief       - This function configures priority of interrupts
 *
 * @param[in]   - IRQ Interrupt number
 * @param[in]   - IRQ priority level
 *
 * @return      - None
 *
 * @Note        - None
 *
 *****************************************************************/
void USART_IRQPriorityConfig(uint8_t IRQNumber, uint32_t IRQPriority)
{
    uint8_t iprx           = IRQNumber / 4;
    uint8_t iprx_section   = IRQNumber % 4;

    uint8_t shift_amount = ( 8 * iprx_section) + ( 8 - NO_PR_BITS_IMPLEMENTED);
    *( NVIC_PS_BASEADDR + iprx ) |= ( IRQPriority << shift_amount );
}

/*********************************************************************
 * @fn      		  - USART_SendData
 *
 * @brief             -
 *
 * @param[in]         -
 * @param[in]         -
 * @param[in]         -
 *
 * @return            -
 *
 * @Note              - 
 */
void USART_SendData(USART_Handle_t *pUSARTHandle, uint8_t *pTxBuffer, uint32_t Len)
{

	uint16_t *pdata;

   // Loop over until "Len" number of bytes are transferred
	for(uint32_t i = 0 ; i < Len; i++)
	{
		// Wait until TXE flag is set in the SR
		while(! USART_GetFlagStatus(pUSARTHandle->pUSARTx, USART_FLAG_TXE));

         // Check the USART_WordLength item for 7BIT, 8BIT or 9BIT in a frame
		if(pUSARTHandle->USART_Config.USART_WordLength == USART_WORDLEN_9BITS)
		{
			// If 9BIT, load the DR with 2bytes masking the bits other than first 9 bits 
			pdata = (uint16_t*) pTxBuffer;
			pUSARTHandle->pUSARTx->USART_TDR = (*pdata & (uint16_t)0x01FF);
			
			// Check for USART_ParityControl
			if(pUSARTHandle->USART_Config.USART_ParityControl == USART_PARITY_DISABLE)
			{
				// No parity is used in this transfer. so, 9bits of user data will be sent
				pTxBuffer++;
				pTxBuffer++;
			}
			else
			{
				// Parity bit is used in this transfer. So, 8bits of user data will be sent
				// The 9th bit will be replaced by parity bit by the hardware
				pTxBuffer++;
			}
		}else if(pUSARTHandle->USART_Config.USART_WordLength == USART_WORDLEN_8BITS)
		{
			// This is 8bit data transfer 
			pUSARTHandle->pUSARTx->USART_TDR = (*pTxBuffer  & (uint8_t)0xFF);
			pTxBuffer++;

		}else if(pUSARTHandle->USART_Config.USART_WordLength == USART_WORDLEN_7BITS)
		{
			// This is 7bit data transfer 
			pUSARTHandle->pUSARTx->USART_TDR = (*pTxBuffer  & (uint8_t)0x7F);
			pTxBuffer++;
		}
	}

	// wait till TC flag is set in the SR
	while( ! USART_GetFlagStatus(pUSARTHandle->pUSARTx, USART_FLAG_TC) );
}


/*********************************************************************
 * @fn      		  - USART_ReceiveData
 *
 * @brief             -
 *
 * @param[in]         -
 * @param[in]         -
 * @param[in]         -
 *
 * @return            -
 *
 * @Note              -
 */
void USART_ReceiveData(USART_Handle_t *pUSARTHandle, uint8_t *pRxBuffer, uint32_t Len)
{
    // Loop over until "Len" number of bytes are transferred
	for(uint32_t i = 0 ; i < Len; i++)
	{
		// Wait until RXNE flag is set in the SR
		while(! USART_GetFlagStatus(pUSARTHandle->pUSARTx, USART_FLAG_RXNE));

		// Check the USART_WordLength to decide whether we are going to receive 9bit of data in a frame or 8 bit
		if( pUSARTHandle->USART_Config.USART_WordLength == USART_WORDLEN_9BITS )
		{
			// Check are we using USART_ParityControl control or not
			if(pUSARTHandle->USART_Config.USART_ParityControl == USART_PARITY_DISABLE)
			{
				// No parity is used. so, all 9bits will be of user data
				// Read only first 9 bits. so, mask the DR with 0x01FF
				*((uint16_t*) pRxBuffer) = ( pUSARTHandle->pUSARTx->USART_RDR & (uint16_t) 0x01FF );
				pRxBuffer++;
				pRxBuffer++;
			}
			else
			{
				// Parity is used, so, 8bits will be of user data and 1 bit is parity
				*pRxBuffer = (pUSARTHandle->pUSARTx->USART_RDR & (uint8_t)0xFF);
				pRxBuffer++;
			}
		}
		else
		{
			// Check are we using USART_ParityControl control or not
			if(pUSARTHandle->USART_Config.USART_ParityControl == USART_PARITY_DISABLE)
			{
				// No parity is used , so all 8bits will be of user data

				// Read 8 bits from DR
				 *pRxBuffer = (pUSARTHandle->pUSARTx->USART_RDR & (uint8_t)0xFF);
			}else
			{
				// Parity is used, so , 7 bits will be of user data and 1 bit is parity

				// Read only 7 bits , hence mask the DR with 0X7F
				*pRxBuffer = (uint8_t) (pUSARTHandle->pUSARTx->USART_RDR & (uint8_t)0X7F);
			}
			pRxBuffer++;
		}
	}
}

/*********************************************************************
 * @fn      		  - USART_SendDataWithIT
 *
 * @brief             -
 *
 * @param[in]         -
 * @param[in]         -
 * @param[in]         -
 *
 * @return            -
 *
 * @Note              - Resolve all the TODOs 
 */
uint8_t USART_SendDataIT(USART_Handle_t *pUSARTHandle,uint8_t *pTxBuffer, uint32_t Len)
{
	uint8_t txstate = pUSARTHandle->TxBusyState;

	if(txstate != USART_BUSY_IN_TX)
	{
		pUSARTHandle->TxLen = Len;
		pUSARTHandle->pTxBuffer = pTxBuffer;
		pUSARTHandle->TxBusyState = USART_BUSY_IN_TX;

		// Enable interrupt for TXE
		pUSARTHandle->pUSARTx->USART_CR1 |= ( 1 << USART_CR1_TXEIE);
		
		// Enable interrupt for TC 
		pUSARTHandle->pUSARTx->USART_CR1 |= ( 1 << USART_CR1_TCIE);		
	}
	return txstate;
}

/*********************************************************************
 * @fn      		  - USART_ReceiveDataIT
 *
 * @brief             -
 *
 * @param[in]         -
 * @param[in]         -
 * @param[in]         -
 *
 * @return            -
 *
 * @Note              - 

 */
uint8_t USART_ReceiveDataIT(USART_Handle_t *pUSARTHandle,uint8_t *pRxBuffer, uint32_t Len)
{
	uint8_t rxstate = pUSARTHandle->RxBusyState;

	if( rxstate != USART_BUSY_IN_RX )
	{
		pUSARTHandle->RxLen = Len;
		pUSARTHandle->pRxBuffer = pRxBuffer;
		pUSARTHandle->RxBusyState = USART_BUSY_IN_RX;

