ardaunal4/STM32F334xxDrivers/stm32f334xx_drivers/drivers/Src/stm32f334xx_usart_driver.c
        (void)pUSARTHandle->pUSARTx->USART_RDR;

		// Enable interrupt for RXNE
		pUSARTHandle->pUSARTx->USART_CR1 |= ( 1 << USART_CR1_RXNEIE );	
	}
	return rxstate;
}

/*********************************************************************
 * @fn      		  - USART_SetBaudRate
 *
 * @brief             -
 *
 * @param[in]         -
 * @param[in]         -
 * @param[in]         -
 *
 * @return            -
 *
 * @Note              -  

 */
void USART_SetBaudRate(USART_RegDef_t *pUSARTx, uint32_t BaudRate)
{

	// Variable to hold the APB clock
	uint32_t PCLKx;

	uint32_t usartdiv;

	// Variables to hold Mantissa and Fraction values
	uint32_t M_part, F_part;

	uint32_t tempreg=0;

	// Get the value of APB bus clock in to the variable PCLKx
	if( pUSARTx == USART1 )
	{
		// USART1 is hanging on APB2 bus
		PCLKx = RCC_GetPCLK2Value();
	}else
	{
		PCLKx = RCC_GetPCLK1Value();
	}

	// Check for OVER8 configuration bit
	if( pUSARTx->USART_CR1 & (1 << USART_CR1_OVER8) )
	{
		// OVER8 = 1 , over sampling by 8
		usartdiv = ( (25 * PCLKx) / (2 * BaudRate) );
	}else
	{
		// Over sampling by 16
		usartdiv = ( (25 * PCLKx) / (4 * BaudRate) );
	}

	// Calculate the Mantissa part
	M_part = usartdiv/100;

	// Place the Mantissa part in appropriate bit position . refer USART_BRR
	tempreg |= M_part << 4;

	// Extract the fraction part
	F_part = (usartdiv - (M_part * 100));

	// Calculate the final fractional
	if( pUSARTx->USART_CR1 & ( 1 << USART_CR1_OVER8) )
	{
		// OVER8 = 1 , over sampling by 8
		F_part = ( (( F_part * 8)+ 50) / 100 ) & ( (uint8_t)0x07 );
	}else
	{
		// Over sampling by 16
		F_part = ( (( F_part * 16)+ 50) / 100 ) & ( (uint8_t)0x0F );
	}

	// Place the fractional part in appropriate bit position . refer USART_BRR
	tempreg |= F_part;

	// Copy the value of tempreg in to BRR register
	pUSARTx->USART_BRR = tempreg;
}

/*********************************************************************
 * @fn      		  - USART_IRQHandler
 *
 * @brief             -
 *
 * @param[in]         -
 * @param[in]         -
 * @param[in]         -
 *
 * @return            -
 *
 * @Note              - 

 */
void USART_IRQHandling(USART_Handle_t *pUSARTHandle)
{
	uint32_t temp1 , temp2, temp3;
	uint16_t *pdata;

	/*************************Check for TC flag ********************************************/
    // Check the state of TC bit in the SR
	temp1 = pUSARTHandle->pUSARTx->USART_ISR & ( 1 << USART_ISR_TC);
	
	 // Check the state of TXEIE bit 
	temp2 = pUSARTHandle->pUSARTx->USART_CR1 & ( 1 << USART_CR1_TXEIE);

	if( temp1 && temp2 )
	{
		// This interrupt is because of TC
		
		// Close transmission and call application callback if TxLen is zero
		if ( pUSARTHandle->TxBusyState == USART_BUSY_IN_TX)
		{
			// Check the TxLen . If it is zero then close the data transmission
			if(! pUSARTHandle->TxLen )
			{
				// Clear the TC flag
				pUSARTHandle->pUSARTx->USART_ISR &= ~( 1 << USART_ISR_TC);
				
				// Clear the TCIE control bit 
				pUSARTHandle->pUSARTx->USART_CR1 &= ~( 1 << USART_CR1_TCIE);

				//Reset the application state
				pUSARTHandle->TxBusyState = USART_READY;
				
				//Reset Buffer address to NULL
				pUSARTHandle->pTxBuffer = NULL;
				
				//Reset the length to zero
				pUSARTHandle->TxLen = 0;
				
				//Call the applicaton call back with event USART_EVENT_TX_CMPLT
				USART_ApplicationEventCallback(pUSARTHandle, USART_EVENT_TX_CMPLT);
			}
		}
	}

	/*************************Check for TXE flag ********************************************/
	// Check the state of TXE bit in the SR
	temp1 = pUSARTHandle->pUSARTx->USART_ISR & ( 1 << USART_ISR_TXE);
	
	// Check the state of TXEIE bit in CR1
	temp2 = pUSARTHandle->pUSARTx->USART_CR1 & ( 1 << USART_CR1_TXEIE);;

	if( temp1 && temp2 )
	{
		// This interrupt is because of TXE
		
		if( pUSARTHandle->TxBusyState == USART_BUSY_IN_TX )
		{
			// Keep sending data until Txlen reaches to zero
			if( pUSARTHandle->TxLen > 0 )
			{
				// Check the USART_WordLength item for 9BIT or 8BIT in a frame
				if(pUSARTHandle->USART_Config.USART_WordLength == USART_WORDLEN_9BITS)
				{
					// If 9BIT , load the DR with 2bytes masking the bits other than first 9 bits
					pdata = (uint16_t*) pUSARTHandle->pTxBuffer;
					
					// Loading only first 9 bits , so we have to mask with the value 0x01FF
					pUSARTHandle->pUSARTx->USART_TDR = (*pdata & (uint16_t)0x01FF);

					// Check for USART_ParityControl
					if(pUSARTHandle->USART_Config.USART_ParityControl == USART_PARITY_DISABLE)
					{
						// No parity is used in this transfer , so, 9bits of user data will be sent
						// Increment pTxBuffer twice
						pUSARTHandle->pTxBuffer++;
						pUSARTHandle->pTxBuffer++;
						
						// Decrement the length
						pUSARTHandle->TxLen -= 2;
					}
					else
					{
						// Parity bit is used in this transfer . so , 8bits of user data will be sent
						// The 9th bit will be replaced by parity bit by the hardware
						pUSARTHandle->pTxBuffer++;
						
						// Decrement the length
						pUSARTHandle->TxLen--;
					}
				}
				else
				{
					// This is 8bit data transfer
					pUSARTHandle->pUSARTx->USART_TDR = (*pUSARTHandle->pTxBuffer++  & (uint8_t)0xFF);

					// Increment the buffer address
					pUSARTHandle->pTxBuffer++;
					
					// Decrement the length
					pUSARTHandle->TxLen--;
				}
				
			}
			if (pUSARTHandle->TxLen == 0 )
			{
				// TxLen is zero 
				// Clear the TXEIE bit (disable interrupt for TXE flag )
				pUSARTHandle->pUSARTx->USART_CR1 &= ~( 1 << USART_CR1_TXEIE);
			}
		}
	}
	
	/*************************Check for RXNE flag ********************************************/

	temp1 = pUSARTHandle->pUSARTx->USART_ISR & ( 1 << USART_ISR_RXNE);
	temp2 = pUSARTHandle->pUSARTx->USART_CR1 & ( 1 << USART_CR1_RXNEIE);


	if( temp1 && temp2 )
	{
		// This interrupt is because of rxne and txe
		if(pUSARTHandle->RxBusyState == USART_BUSY_IN_RX)
		{
			// TXE is set so send data
			if(pUSARTHandle->RxLen > 0)
			{
				// Check the USART_WordLength to decide whether we are going to receive 9bit of data in a frame or 8 bit
				if(pUSARTHandle->USART_Config.USART_WordLength == USART_WORDLEN_9BITS)
				{
					// We are going to receive 9bit data in a frame

					// Now, check are we using USART_ParityControl control or not
					if(pUSARTHandle->USART_Config.USART_ParityControl == USART_PARITY_DISABLE)
					{
						// No parity is used. so, all 9bits will be of user data

						// Read only first 9 bits so mask the DR with 0x01FF
						*((uint16_t*) pUSARTHandle->pRxBuffer) = (pUSARTHandle->pUSARTx->USART_RDR  & (uint16_t)0x01FF);

						// Now increment the pRxBuffer two times
						pUSARTHandle->pRxBuffer++;
						pUSARTHandle->pRxBuffer++;
						
