ardaunal4/STM32F334xxDrivers/stm32f334xx_drivers/drivers/Src/stm32f334xx_usart_driver.c
						// Decrement the length
						pUSARTHandle->RxLen -= 2;
					}
					else
					{
						// Parity is used. so, 8bits will be of user data and 1 bit is parity
						*pUSARTHandle->pRxBuffer = (pUSARTHandle->pUSARTx->USART_RDR  & (uint8_t)0xFF);
						 
						// Now increment the pRxBuffer
						pUSARTHandle->pRxBuffer++;
						 
						// Decrement the length
						pUSARTHandle->RxLen--;
					}
				}
				else
				{
					// We are going to receive 8bit data in a frame

					// Now, check are we using USART_ParityControl control or not
					if(pUSARTHandle->USART_Config.USART_ParityControl == USART_PARITY_DISABLE)
					{
						// No parity is used , so all 8bits will be of user data

						// Read 8 bits from DR
						*pUSARTHandle->pRxBuffer = (uint8_t) (pUSARTHandle->pUSARTx->USART_RDR  & (uint8_t)0xFF);
					}

					else
					{
						// Parity is used, so , 7 bits will be of user data and 1 bit is parity

						// Read only 7 bits , hence mask the DR with 0X7F
						 *pUSARTHandle->pRxBuffer = (uint8_t) (pUSARTHandle->pUSARTx->USART_RDR  & (uint8_t)0x7F);
					}
					// Now , increment the pRxBuffer
					pUSARTHandle->pRxBuffer++;
					
					// Decrement the length
					pUSARTHandle->RxLen--;
				}			
			}//if of >0

			if(! pUSARTHandle->RxLen)
			{
				//disable the rxne
				pUSARTHandle->pUSARTx->USART_CR1 &= ~( 1 << USART_CR1_RXNEIE );
				pUSARTHandle->RxBusyState = USART_READY;
				USART_ApplicationEventCallback(pUSARTHandle, USART_EVENT_RX_CMPLT);
			}
		}
	}
		
	/*************************Check for CTS flag ********************************************/
	//Note : CTS feature is not applicable for UART4 and UART5

	// Check the status of CTS bit in the SR
	temp1 = pUSARTHandle->pUSARTx->USART_ISR & ( 1 << USART_ISR_CTS);
	
	// Check the state of CTSE bit in CR1
	temp2 = pUSARTHandle->pUSARTx->USART_CR3 & ( 1 << USART_CR3_CTSE);
	
	// Check the state of CTSIE bit in CR3 (This bit is not available for UART4 & UART5.)
	temp3 = pUSARTHandle->pUSARTx->USART_CR3 & ( 1 << USART_CR3_CTSIE);


	if(temp1  && temp2 )
	{
		// Clear the CTS flag in SR
		pUSARTHandle->pUSARTx->USART_ISR &=  ~( 1 << USART_ISR_CTS);
		
		// This interrupt is because of cts
		USART_ApplicationEventCallback(pUSARTHandle, USART_EVENT_CTS);
	}

/*************************Check for IDLE detection flag ********************************************/

	// Check the status of IDLE flag bit in the SR
	temp1 = pUSARTHandle->pUSARTx->USART_ISR & ( 1 << USART_ISR_IDLE);
	
	// Check the state of IDLEIE bit in CR1
	temp2 = pUSARTHandle->pUSARTx->USART_CR3 & ( 1 << USART_CR3_CTSE);

	if(temp1 && temp2)
	{
		// Clear the IDLE flag. Refer to the RM to understand the clear sequence 
		temp1 = pUSARTHandle->pUSARTx->USART_ISR &= ~( 1 << USART_ISR_IDLE);

		// This interrupt is because of idle
		USART_ApplicationEventCallback(pUSARTHandle,USART_EVENT_IDLE);
	}

/*************************Check for Overrun detection flag ********************************************/

	// Check the status of ORE flag  in the SR
	temp1 = pUSARTHandle->pUSARTx->USART_ISR & USART_ISR_ORE;
	
	// Check the status of RXNEIE  bit in the CR1
	temp2 = pUSARTHandle->pUSARTx->USART_CR1 & USART_CR1_RXNEIE;


	if(temp1  && temp2 )
	{
		// Need not to clear the ORE flag here, instead give an api for the application to clear the ORE flag . 
		
		// This interrupt is because of Overrun error 
		USART_ApplicationEventCallback(pUSARTHandle, USART_ERR_ORE);
	}



	/*************************Check for Error Flag ********************************************/

	// Noise Flag, Overrun error and Framing Error in multibuffer communication
	// We dont discuss multibuffer communication in this course. please refer to the RM
	// The blow code will get executed in only if multibuffer mode is used. 

	temp2 = pUSARTHandle->pUSARTx->USART_CR2 & ( 1 << USART_CR3_EIE) ;

	if(temp2 )
	{
		temp1 = pUSARTHandle->pUSARTx->USART_ISR;
		if(temp1 & (1 << USART_ISR_FE))
		{
			/*
				This bit is set by hardware when a de-synchronization, excessive noise or a break character
				is detected. It is cleared by a software sequence (an read to the USART_SR register
				followed by a read to the USART_DR register).
			*/
			USART_ApplicationEventCallback(pUSARTHandle, USART_ERR_FE);
		}

		if(temp1 & ( 1 << USART_ISR_NF) )
		{
			/*
				This bit is set by hardware when noise is detected on a received frame. It is cleared by a
				software sequence (an read to the USART_SR register followed by a read to the
				USART_DR register).
			*/
			USART_ApplicationEventCallback(pUSARTHandle, USART_ERR_NF);
		}

		if(temp1 & ( 1 << USART_ISR_ORE) )
		{
			USART_ApplicationEventCallback(pUSARTHandle, USART_ERR_ORE);
		}
	}
} 
